Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinDesignOptions Property
 An element cannot join to an element in a secondary Design Option unless it is in the same secondary Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinDesignOptions { get; }
Public Shared ReadOnly Property CannotJoinDesignOptions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinDesignOptions {
	FailureDefinitionId^ get ();
}
static member CannotJoinDesignOptions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace